//재귀함수 == 내가 나를 호출하는 함수
// 반복문 <-> 재귀함수 (서로 호환됨)


//1. 합

//(1) 일반 반복문
let s = 0;
for (var i=1; i<101; i++) {
    s += i;
}

//(2) 수학공식
let n = 100;
console.log((n*(n+1)/2));


//(3) 재귀함수
//순번   f(n)     n       return       
//1      f(100)  100     100 + f(99)
//2      f(99)    99      99 + f(98)
//...
//       f(2)     2        2 + f(1)
//       f(1)     1        1

function f(n) {
    if (n<=1) {
        return 1;
    }
    return n + f(n-1);
}

console.log(`재귀함수: ${f(100)}`);


//------------------------------------------------//
//2. 곱
//(1)일반 반복문
let m = 1;
for (var j=1; j<6; j++) {
    m *= j;
}

//(2) 재귀함수

function f(n) {
    if (n<=1) {
        return 1;
    }
    return n * f(n-1);
}

console.log(`재귀함수: ${f(100)}`);